[
  {
    "id": 1,
    "image": "/images/3d-sticky-note-app.jpg",
    "title": "3D Sticky Note App",
    "description": "This is a React Three Fiber app currently under construction. I will be updating this app continually, so keep an eye out. The app will be able to save your sticky note reminders in a physical place, so it's easier to remember later. Think mind palace. Used React, Threejs, React Three Fiber, React Three Drei, React Three Postprocessing, React Three Cannon, Vite, and JavaScript.",
    "deployedUrl": "",
    "deployedTitle": "3D Sticky Note App",
    "repoUrl": "https://github.com/BrockBatBlue/3D-sticky-note-app"
  },
  {
    "id": 2,
    "image": "/images/car-mini-game.jpg",
    "title": "3D Car Mini Game",
    "description": "This is a React Three Fiber mini game originally created by Irradiance on YouTube as a tutorial. I made some slight changes for better car movement, but it's still slightly buggy. Learning to create this game gave me the React Three Fiber bug. I'll never go back. Used React, Threejs, React Three Fiber, React Three Drei, React Three Cannon, Vite, and JavaScript.",
    "deployedUrl": "",
    "deployedTitle": "3D Car Mini Game",
    "repoUrl": "https://github.com/BrockBatBlue/R3F-car-mini-game"
  },
  {
    "id": 3,
    "image": "/images/fetch-LAB-tailwind.jpg",
    "title": "Fetched Last Air Bender Characters",
    "description": "This is a React app fetching random Last Air Bender character pictures. The characters do not repeat on refresh, so you'll always see someone new. The styling was done using Tailwind. I had not used Tailwind before and found the component-based styling extremely useful. Used React, Vite, Tailwind, Axios, and JavaScript.",
    "deployedUrl": "",
    "deployedTitle": "Fetched Last Air Bender Characters",
    "repoUrl": "https://github.com/BrockBatBlue/last-air-bender-tailwind"
  },
  {
    "id": 4,
    "image": "images/quizResultsPage.jpg",
    "title": "Horticulture Quiz",
    "description": "This was my first truly challenging homework assignment. I was afraid I would not get it done in time, and I spent many more hours than usual figuring out how to get it working. I persevered, stayed up late, and drank too much coffee, and created something I am absolutely proud to put on display. This is an entirely front-end application. Used HTML, CSS, Bootstrap CSS, and JavaScript.",
    "deployedUrl": "https://brockbatblue.github.io/Horticulture-Quiz/",
    "deployedTitle": "Horticulture Quiz",
    "repoUrl": "https://github.com/BrockBatBlue/Horticulture-Quiz"
  },
  {
    "id": 5,
    "image": "images/weatherDashboard.jpg",
    "title": "Weather Dashboard",
    "description": "The Weather Dashboard assignment, though one of my exceptionally difficult homework assignments, was the first assignment where I really allowed myself to make the page my own. I used Flex Box for the first time to create stylish responsive page with its own unique flares. This is an entirely front-end application. Used HTML, CSS, Foundation CSS, and JavaScript.",
    "deployedUrl": "https://brockbatblue.github.io/Weather_Dashboard/",
    "deployedTitle": "Weather Dashboard",
    "repoUrl": "https://github.com/BrockBatBlue/Weather_Dashboard"
  },
  {
    "id": 6,
    "image": "images/eat-da-burger.jpg",
    "title": "Burger Eating App",
    "description": "This application will allow the user to devour submitted burgers they so desire, devour that burger, and then spit it right back up to be devoured any time they'd like. It has limited entertainment value, but a quick kick 😝. This is a full stack application. Used HTML, CSS, JavaScript, Express, Express-handlebars, and MySql",
    "deployedUrl": "https://burger-eat-burger-up.herokuapp.com/",
    "deployedTitle": "Burger Eat App",
    "repoUrl": "https://github.com/BrockBatBlue/burger_eater_hw_wk_13"
  },
  {
    "id": 7,
    "image": "images/handshakeHome.jpg",
    "title": "Handshake",
    "description": "This is an application focused on local businesses that might not have the ability to get their services noticed the way big companies can. This app allows small service businesses to add their information, get reviews, and connect with their community. This also gives clients the opportunity to find more affordable and local services right in their neighborhood. This is a full stack application. Used HTML, CSS, Bootstrap CSS, Google fonts, JavaScript, jQuery, Express, Express-handlebars, and MySql",
    "deployedTitle": "Handshake",
    "repoUrl": "https://github.com/BrockBatBlue/Project_2"
  },
  {
    "id": 8,
    "image": "images/workdayScheduler.jpg",
    "title": "Work Day Scheduler",
    "description": "This app allows the user to keep track of their scheduling needs and gives the user indicators when time has passed for a certain deadline. Each task or appointment can be saved for the user. This is an entirely front-end application. Used HTML, CSS, Boostrap CSS, local storage, and JavaScript",
    "deployedUrl": "https://brockbatblue.github.io/Work_Day_Scheduler/",
    "deployedTitle": "Work Day Planner",
    "repoUrl": "https://github.com/BrockBatBlue/Work_Day_Scheduler#work-day-scheduler"
  },
  {
    "id": 9,
    "image": "images/GamerDashLogin.jpg",
    "title": "Gamer Dash",
    "description": "This app pulls from a library of video games and also the community can upload their own personal video games themselves. This is a full stack React application. Used React, AntD CSS, Node, MongoDB, Express, Passport, and JavaScript.",
    "deployedTitle": "Gamer Dash",
    "repoUrl": "https://github.com/hoffman1200/Project3"
  }
]
